# -*- ii: y; -*-
#+TITLE: tilt.kubemacs.org config
** namespaces
  #+begin_src shell
    kubectl get ns
  #+end_src

  #+RESULTS:
  #+begin_example
  NAME                 STATUS   AGE
  default              Active   45m
  ii                   Active   42m
  kube-node-lease      Active   45m
  kube-public          Active   45m
  kube-system          Active   45m
  local-path-storage   Active   45m
  #+end_example
** get services
  #+begin_src shell
    kubectl get services
  #+end_src

  #+RESULTS:
  #+begin_example
  NAME            TYPE        CLUSTER-IP     EXTERNAL-IP   PORT(S)     AGE
  kubemacs-tilt   ClusterIP   10.96.185.30   <none>        10350/TCP   54m
  #+end_example
** tmate
tmate config currently uses the hosted, but we CAN run this in cluster... later.
#+begin_src shell
ps ax | grep tmate
#+end_src

#+RESULTS:
#+begin_example
   93 ?        S      0:03 tmate -F -v -S /tmp/ii.default.target.iisocket new-session -d -c /home/ii/apisnoop/deployment/k8s/kubemacs.org emacsclient --tty /home/ii/apisnoop/deployment/k8s/kubemacs.org/ncw.org
  142 pts/0    S+     0:00 tmate -S /tmp/ii.default.target.iisocket at
 1529 ?        S      0:00 grep tmate
#+end_example

* Bring up tilt
#+begin_src tmate :dir "." :session ii:tilt
  tilt up --host 0.0.0.0
#+end_src
#+begin_src tmate :dir "." :session ii:tilt
  x
#+end_src

If you attempt to do *docker build* and get permissions problems... just
#+begin_src shell
  id
#+end_src

#+RESULTS:
#+begin_example
uid=2000(ii) gid=2000(ii) groups=2000(ii),27(sudo),100(users),107(docker)
#+end_example

#+begin_src shell
  ls -la /var/run/docker.sock
#+end_src

#+RESULTS:
#+begin_example
srw-rw---- 1 root users 0 Feb  6 10:52 /var/run/docker.sock
#+end_example

#+begin_src tmate :dir "." :session ii:docker-fix
  sudo chgrp users /var/run/docker.sock
#+end_src
* These files/folders map to these *.localho.st sites on 127.0.0.1
These will ask for a password.
It is stored in the ~basic-auth~ secrets.
You can set what it is by running this code:
#+begin_src shell
LOGIN=hh
PASSWORD=ii 
kubectl delete secret basic-auth
kubectl create secret generic basic-auth \
--from-literal=auth=$(echo $PASSWORD | htpasswd -i -n $LOGIN)
#+end_src

#+RESULTS:
#+begin_example
secret "basic-auth" deleted
secret/basic-auth created
#+end_example

